const {
    categoriesButtons,
    subCategoryBtn_1000,
    subCategoryBtn_2000,
    subCategoryBtn_3000,
    subCategoryBtn_4000,
    subCategoryBtn_5000,
    subCategoryBtn_6000,
    subCategoryBtn_7000,
    subCategoryBtn_8000,
    subCategoryBtn_9000,
    subCategoryBtn_10000,
    subCategoryBtn_11000,
    subCategoryBtn_12000,
    subCategoryBtn_13000,
    subCategoryBtn_14000,
    subCategoryBtn_15000,
    subCategoryBtn_16000,
    subCategoryBtn_17000,
    subCategoryBtn_18000,
    subCategoryBtn_19000,
    subCategoryBtn_20000,
    subCategoryBtn_21000,

    statesOpts,
    statesButtons,
    subTownBtn_Minsk,
    subTownBtn_Brestskaya,
    subTownBtn_Gomelskaya,
    subTownBtn_Grodnenskaya,
    subTownBtn_Mogilevskaya,
    subTownBtn_Minskaya,
    subTownBtn_Vitebskaya
} = require('./telegramBtn.js');




const categoriesSwitch = (action, objectLink)=>{

    switch (action) {
        case 'c___Недвижимость':
            objectLink.category = 1000; objectLink.subCategory = ""; objectLink.categoryTxt = "Недвижимость";
            return ["<i>Выберите подкатегорию</i> - <b>Недвижимость:</b>", subCategoryBtn_1000]
        case 'c___Авто и запчасти':
            objectLink.category = 2000; objectLink.subCategory = ""; objectLink.categoryTxt = "Авто и запчасти";
            return ["<i>Выберите подкатегорию</i> - <b>Авто и запчасти:</b>", subCategoryBtn_2000]
        case 'c___Бытовая техника':
            objectLink.category = 15000; objectLink.subCategory = ""; objectLink.categoryTxt = "Бытовая техника";
            return ["<i>Выберите подкатегорию</i> - <b>Бытовая техника:</b>", subCategoryBtn_15000]
        case 'c___Компьютерная техника':
            objectLink.category = 16000; objectLink.subCategory = ""; objectLink.categoryTxt = "Компьютерная техника";
            return ["<i>Выберите подкатегорию</i> - <b>Компьютерная техника:</b>", subCategoryBtn_16000]
        case 'c___Телефоны и планшеты':
            objectLink.category = 17000; objectLink.subCategory = ""; objectLink.categoryTxt = "Телефоны и планшеты";
            return ["<i>Выберите подкатегорию</i> - <b>Телефоны и планшеты:</b>", subCategoryBtn_17000]
        case 'c___Электроника':
            objectLink.category = 5000; objectLink.subCategory = ""; objectLink.categoryTxt = "Электроника";
            return ["<i>Выберите подкатегорию</i> - <b>Электроника:</b>", subCategoryBtn_5000]
        case 'c___Женский гардероб':
            objectLink.category = 8000; objectLink.subCategory = ""; objectLink.categoryTxt = "Женский гардероб";
            return ["<i>Выберите подкатегорию</i> - <b>Женский гардероб:</b>", subCategoryBtn_8000]
        case 'c___Мужской гардероб':
            objectLink.category = 19000; objectLink.subCategory = ""; objectLink.categoryTxt = "Мужской гардероб";
            return ["<i>Выберите подкатегорию</i> - <b>Мужской гардероб:</b>", subCategoryBtn_19000]
        case 'c___Красота и здоровье':
            objectLink.category = 18000; objectLink.subCategory = ""; objectLink.categoryTxt = "Красота и здоровье";
            return ["<i>Выберите подкатегорию</i> - <b>Красота и здоровье:</b>", subCategoryBtn_18000]
        case 'c___Всё для детей и мам':
            objectLink.category = 12000; objectLink.subCategory = ""; objectLink.categoryTxt = "Всё для детей и мам";
            return ["<i>Выберите подкатегорию</i> - <b>Всё для детей и мам:</b>", subCategoryBtn_12000]
        case 'c___Мебель':
            objectLink.category = 21000; objectLink.subCategory = ""; objectLink.categoryTxt = "Мебель";
            return ["<i>Выберите подкатегорию</i> - <b>Мебель:</b>", subCategoryBtn_21000]
        case 'c___Все для дома':
            objectLink.category = 3000; objectLink.subCategory = ""; objectLink.categoryTxt = "Все для дома";
            return ["<i>Выберите подкатегорию</i> - <b>Все для дома:</b>", subCategoryBtn_3000]
        case 'c___Ремонт и стройка':
            objectLink.category = 14000; objectLink.subCategory = ""; objectLink.categoryTxt = "Ремонт и стройка";
            return ["<i>Выберите подкатегорию</i> - <b>Ремонт и стройка:</b>", subCategoryBtn_14000]
        case 'c___Сад и огород':
            objectLink.category = 10000; objectLink.subCategory = ""; objectLink.categoryTxt = "Сад и огород";
            return ["<i>Выберите подкатегорию</i> - <b>Сад и огород:</b>", subCategoryBtn_10000]
        case 'c___Хобби, спорт и туризм':
            objectLink.category = 4000; objectLink.subCategory = ""; objectLink.categoryTxt = "Хобби, спорт и туризм";
            return ["<i>Выберите подкатегорию</i> - <b>Хобби, спорт и туризм:</b>", subCategoryBtn_4000]
        case 'c___Свадьба и праздники':
            objectLink.category = 9000; objectLink.subCategory = ""; objectLink.categoryTxt = "Свадьба и праздники";
            return ["<i>Выберите подкатегорию</i> - <b>Свадьба и праздники:</b>", subCategoryBtn_9000]
        case 'c___Животные':
            objectLink.category = 11000; objectLink.subCategory = ""; objectLink.categoryTxt = "Животные";
            return ["<i>Выберите подкатегорию</i> - <b>Животные:</b>", subCategoryBtn_11000]
        case 'c___Готовый бизнес и оборудование':
            objectLink.category = 20000; objectLink.subCategory = ""; objectLink.categoryTxt = "Готовый бизнес и оборудование";
            return ["<i>Выберите подкатегорию</i> - <b>Готовый бизнес и оборудование:</b>", subCategoryBtn_20000]
        case 'c___Работа':
            objectLink.category = 6000; objectLink.subCategory = ""; objectLink.categoryTxt = "Работа";
            return ["<i>Выберите подкатегорию</i> - <b>Работа:</b>", subCategoryBtn_6000]
        case 'c___Услуги':
            objectLink.category = 13000; objectLink.subCategory = ""; objectLink.categoryTxt = "Услуги";
            return ["<i>Выберите подкатегорию</i> - <b>Услуги:</b>", subCategoryBtn_13000]
        case 'c___Прочее':
            objectLink.category = 7000; objectLink.subCategory = ""; objectLink.categoryTxt = "Прочее";
            return ["<i>Выберите подкатегорию</i> - <b>Прочее:</b>", subCategoryBtn_7000]
    }
}


const subCategories_01_Switch = (action)=>{
    switch (action) {
        case 'с_01_По всей категории':
            return [1000, "", "Недвижимость"]
        case 'с_01_Новостройки':
            return [1000, 1120, "Недвижимость, Новостройки"]
        case 'с_01_Квартиры':
            return [1000, 1010, "Недвижимость, Квартиры"]
        case 'с_01_Комнаты':
            return [1000, 1040, "Недвижимость, Комнаты"]
        case 'с_01_Дома, дачи, коттеджи':
            return [1000, 1020, "Недвижимость, Дома, дачи, коттеджи"]
        case 'с_01_Гаражи и стоянки':
            return [1000, 1030, "Недвижимость, Гаражи и стоянки"]
        case 'с_01_Участки':
            return [1000, 1080, "Недвижимость, Участки"]
        case 'с_01_Коммерческая недвижимость':
            return [1000, 1050, "Недвижимость, Коммерческая недвижимость"]
    }
}

const subCategories_02_Switch = (action)=>{
    switch (action) {
        case 'с_02_По всей категории':
            return [2000, "", "Авто и запчасти"]
        case 'с_02_Легковые авто':
            return [2000, 2010, "Авто и запчасти, Легковые авто"]
        case 'с_02_Запчасти':
            return [2000, 2040, "Авто и запчасти, Запчасти"]
        case 'с_02_Грузовики и автобусы':
            return [2000, 2060, "Авто и запчасти, Грузовики и автобусы"]
        case 'с_02_Мототехника':
            return [2000, 2030, "Авто и запчасти, Мототехника"]
        case 'с_02_Сельхозтехника':
            return [2000, 2080, "Авто и запчасти, Сельхозтехника"]
        case 'с_02_Спецтехника':
            return [2000, 2090, "Авто и запчасти, Спецтехника"]
        case 'с_02_Прицепы':
            return [2000, 2020, "Авто и запчасти, Прицепы"]
        case 'с_02_Водный транспорт':
            return [2000, 2050, "Авто и запчасти, Водный транспорт"]
        case 'с_02_Автокресла и бустеры':
            return [2000, 2110, "Авто и запчасти, Автокресла и бустеры"]
        case 'с_02_Аксессуары':
            return [2000, 2045, "Авто и запчасти, Аксессуары"]
        case 'с_02_Шины, диски':
            return [2000, 2075, "Авто и запчасти, Шины, диски"]
        case 'с_02_Инструмент, оборудование':
            return [2000, 2070, "Авто и запчасти, Инструмент, оборудование"]
        case 'с_02_Автохимия и автомасла':
            return [2000, 2120, "Авто и запчасти, Автохимия и автомасла"]
        case 'с_02_Услуги для авто':
            return [2000, 2100, "Авто и запчасти, Услуги для авто"]
    }
}

const subCategories_15_Switch = (action)=>{
    switch (action) {
        case 'с_15_По всей категории':
            return [15000, "", "Бытовая техника"]
        case 'с_15_Техника для кухни':
            return [15000, 15010, "Бытовая техника, Техника для кухни"]
        case 'с_15_Крупная техника для кухни':
            return [15000, 15020, "Бытовая техника, Крупная техника для кухни"]
        case 'с_15_Техника для уборки':
            return [15000, 15030, "Бытовая техника, Техника для уборки"]
        case 'с_15_Уход за одеждой, пошив':
            return [15000, 15040, "Бытовая техника, Уход за одеждой, пошив"]
        case 'с_15_Климатическая техника':
            return [15000, 15050, "Бытовая техника, Климатическая техника"]
        case 'с_15_Техника для красоты и здоровья':
            return [15000, 15060, "Бытовая техника, Техника для красоты и здоровья"]
    }
}

const subCategories_16_Switch = (action)=>{
    switch (action) {
        case 'с_16_По всей категории':
            return [16000, "", "Компьютерная техника"]
        case 'с_16_Ноутбуки':
            return [16000, 16040, "Компьютерная техника, Ноутбуки"]
        case 'с_16_Компьютеры / системные блоки':
            return [16000, 16020, "Компьютерная техника, Компьютеры / системные блоки"]
        case 'с_16_Мониторы':
            return [16000, 16030, "Компьютерная техника, Мониторы"]
        case 'с_16_Комплектующие':
            return [16000, 16010, "Компьютерная техника, Комплектующие"]
        case 'с_16_Оргтехника':
            return [16000, 16050, "Компьютерная техника, Оргтехника"]
        case 'с_16_Периферия и аксессуары':
            return [16000, 16060, "Компьютерная техника, Периферия и аксессуары"]
        case 'с_16_Сетевое оборудование':
            return [16000, 16070, "Компьютерная техника, Сетевое оборудование"]
        case 'с_16_Прочие компьютерные товары':
            return [16000, 16080, "Компьютерная техника, Прочие компьютерные товары"]
    }
}

const subCategories_17_Switch = (action)=>{
    switch (action) {
        case 'с_17_По всей категории':
            return [17000, "", "Телефоны и планшеты"]
        case 'с_17_Мобильные телефоны':
            return [17000, 17010, "Телефоны и планшеты, Мобильные телефоны"]
        case 'с_17_Комплектующие для телефонов':
            return [17000, 17020, "Телефоны и планшеты, Комплектующие для телефонов"]
        case 'с_17_Аксессуары для телефонов':
            return [17000, 17030, "Телефоны и планшеты, Аксессуары для телефонов"]
        case 'с_17_Телефония и связь':
            return [17000, 17040, "Телефоны и планшеты, Телефония и связь"]
        case 'с_17_Планшеты':
            return [17000, 17050, "Телефоны и планшеты, Планшеты"]
        case 'с_17_Графические планшеты':
            return [17000, 17060, "Телефоны и планшеты, Графические планшеты"]
        case 'с_17_Электронные книги':
            return [17000, 17070, "Телефоны и планшеты, Электронные книги"]
        case 'с_17_Умные часы и фитнес-браслеты':
            return [17000, 17090, "Телефоны и планшеты, Умные часы и фитнес-браслеты"]
        case 'с_17_Аксессуары для планшетов и книг':
            return [17000, 17080, "Телефоны и планшеты, Аксессуары для планшетов и книг"]
        case 'с_17_Наушники':
            return [17000, 17100, "Телефоны и планшеты, Наушники"]
    }
}


const subCategories_05_Switch = (action)=>{
    switch (action) {
        case 'с_05_По всей категории':
            return [5000, "", "Электроника"]
        case 'с_05_Аудиотехника':
            return [5000, 5020, "Электроника, Аудиотехника"]
        case 'с_05_Наушники':
            return [5000, 5100, "Электроника, Наушники"]
        case 'с_05_ТВ и видеотехника':
            return [5000, 5060, "Электроника, ТВ и видеотехника"]
        case 'с_05_Фототехника и оптика':
            return [5000, 5070, "Электроника, Фототехника и оптика"]
        case 'с_05_Игры и приставки':
            return [5000, 5040, "Электроника, Игры и приставки"]
        case 'с_05_Безопасность и умный дом':
            return [5000, 5110, "Электроника, Безопасность и умный дом"]   
    }
}




const subCategories_08_Switch = (action)=>{
    switch (action) {
        case 'с_08_По всей категории':
            return [8000, "", "Женский гардероб"]
        case 'с_08_Премиум одежда':
            return [8000, 8110, "Женский гардероб, Премиум одежда"]
        case 'с_08_Женская одежда':
            return [8000, 8080, "Женский гардероб, Женская одежда"]
        case 'с_08_Женская обувь':
            return [8000, 8100, "Женский гардероб, Женская обувь"]
        case 'с_08_Женские аксессуары':
            return [8000, 8020, "Женский гардероб, Женские аксессуары"]
        case 'с_08_Ремонт и пошив одежды':
            return [8000, 8050, "Женский гардероб, Ремонт и пошив одежды"]
        case 'с_08_Одежда для беременных':
            return [8000, 8060, "Женский гардероб, Одежда для беременных"]   
    }
}

const subCategories_19_Switch = (action)=>{
    switch (action) {
        case 'с_19_По всей категории':
            return [19000, "", "Мужской гардероб"]
        case 'с_19_Мужская одежда':
            return [19000, 19010, "Мужской гардероб, Мужская одежда"]
        case 'с_19_Мужская обувь':
            return [19000, 19020, "Мужской гардероб, Мужская обувь"]
        case 'с_19_Мужские аксессуары':
            return [19000, 19030, "Мужской гардероб, Мужские аксессуары"]
    }
}

const subCategories_18_Switch = (action)=>{
    switch (action) {
        case 'с_18_По всей категории':
            return [18000, "", "Красота и здоровье"]
        case 'с_18_Декоративная косметика':
            return [18000, 18010, "Красота и здоровье, Декоративная косметика"]
        case 'с_18_Уходовая косметика':
            return [18000, 18020, "Красота и здоровье, Уходовая косметика"]
        case 'с_18_Парфюмерия':
            return [18000, 18030, "Красота и здоровье, Парфюмерия"]
        case 'с_18_Маникюр, педикюр':
            return [18000, 18040, "Красота и здоровье, Маникюр, педикюр"]
        case 'с_18_Средства для волос':
            return [18000, 18050, "Красота и здоровье, Средства для волос"]
        case 'с_18_Средства гигиены, депиляция':
            return [18000, 18060, "Красота и здоровье, Средства гигиены, депиляция"]
        case 'с_18_Ресницы и брови, татуаж':
            return [18000, 18070, "Красота и здоровье, Ресницы и брови, татуаж"]
        case 'с_18_Косметические аксессуары':
            return [18000, 18090, "Красота и здоровье, Косметические аксессуары"]
        case 'с_18_Медицинские товары':
            return [18000, 18080, "Красота и здоровье, Медицинские товары"]
        case 'с_18_Техника для красоты и здоровья':
            return [18000, 8120, "Красота и здоровье, Техника для красоты и здоровья"]
        case 'с_18_Услуги: красота и здоровье':
            return [18000, 18100, "Красота и здоровье, Услуги: красота и здоровье"]   
    }
}


const subCategories_12_Switch = (action)=>{
    switch (action) {
        case 'с_12_По всей категории':
            return [12000, "", "Всё для детей и мам"]
        case 'с_12_Одежда до 1 года':
            return [12000, 12010, "Всё для детей и мам, Одежда до 1 года"]
        case 'с_12_Одежда для девочек':
            return [12000, 12140, "Всё для детей и мам, Одежда для девочек"]
        case 'с_12_Одежда для мальчиков':
            return [12000, 12150, "Всё для детей и мам, Одежда для мальчиков"]
        case 'с_12_Аксессуары для детей':
            return [12000, 12170, "Всё для детей и мам, Аксессуары для детей"]
        case 'с_12_Детская обувь':
            return [12000, 12020, "Всё для детей и мам, Детская обувь"]
        case 'с_12_Ходунки, шезлонги, качели':
            return [12000, 12040, "Всё для детей и мам, Ходунки, шезлонги, качели"]
        case 'с_12_Коляски':
            return [12000, 12050, "Всё для детей и мам, Коляски"]
        case 'с_12_Автокресла и бустеры':
            return [12000, 12060, "Всё для детей и мам, Автокресла и бустеры"]
        case 'с_12_Кормление и уход':
            return [12000, 12070, "Всё для детей и мам, Кормление и уход"]
        case 'с_12_Текстиль для детей':
            return [12000, 12160, "Всё для детей и мам, Текстиль для детей"]
        case 'с_12_Сумки-кенгуру и слинги':
            return [12000, 12080, "Всё для детей и мам, Сумки-кенгуру и слинги"]
        case 'с_12_Игрушки и книги':
            return [12000, 12090, "Всё для детей и мам, Игрушки и книги"]
        case 'с_12_Детский транспорт':
            return [12000, 12100, "Всё для детей и мам, Детский транспорт"]
        case 'с_12_Товары для мам':
            return [12000, 12110, "Всё для детей и мам, Товары для мам"]
        case 'с_12_Одежда для беременных':
            return [12000, 12120, "Всё для детей и мам, Одежда для беременных"]
        case 'с_12_Прочие товары для детей':
            return [12000, 12130, "Всё для детей и мам, Прочие товары для детей"]
        case 'с_12_Детская мебель':
            return [12000, 12180, "Всё для детей и мам, Детская мебель"]  
    }
}


const subCategories_21_Switch = (action)=>{
    switch (action) {
        case 'с_21_По всей категории':
            return [21000, "", "Мебель"]
        case 'с_21_Банкетки, пуфики':
            return [21000, 21010, "Мебель, Банкетки, пуфики"]
        case 'с_21_Вешалки, прихожие':
            return [21000, 21020, "Мебель, Вешалки, прихожие"]
        case 'с_21_Детская мебель':
            return [21000, 21180, "Мебель, Детская мебель"]
        case 'с_21_Комоды':
            return [21000, 21030, "Мебель, Комоды"]
        case 'с_21_Кровати,матрасы':
            return [21000, 21040, "Мебель, Кровати,матрасы"]
        case 'с_21_Кухни':
            return [21000, 21050, "Мебель, Ходунки, Кухни"]
        case 'с_21_Кухонные уголки':
            return [21000, 21060, "Мебель, Кухонные уголки"]
        case 'с_21_Мягкая мебель':
            return [21000, 21070, "Мебель, Мягкая мебель"]
        case 'с_21_Полки, стеллажи, шкафчики':
            return [21000, 21090, "Мебель, Полки, стеллажи, шкафчики"]
        case 'с_21_Спальные гарнитуры':
            return [21000, 21100, "Мебель, Спальные гарнитуры"]
        case 'с_21_Стенки, секции, модули':
            return [21000, 21110, "Мебель, Стенки, секции, модули"]
        case 'с_21_Столы и обеденные группы':
            return [21000, 21120, "Мебель, Столы и обеденные группы"]
        case 'с_21_Стулья':
            return [21000, 21130, "Мебель, Стулья"]
        case 'с_21_Тумбы, буфеты':
            return [21000, 21140, "Мебель, Тумбы, буфеты"]
        case 'с_21_Шкафы':
            return [21000, 21150, "Мебель, Шкафы"]
        case 'с_21_Мебельная фурнитура и составл.':
            return [21000, 21160, "Мебель, Мебельная фурнитура и составляющ."]
        case 'с_21_Прочая мебель':
            return [21000, 21170, "Мебель, Прочая мебель"]   
    }
}

const subCategories_03_Switch = (action)=>{
    switch (action) {
        case 'с_03_По всей категории':
            return [3000, "", "Все для дома"]
        case 'с_03_Предметы интерьера, зеркала':
            return [3000, 3060, "Все для дома, Предметы интерьера, зеркала"]
        case 'с_03_Шторы, жалюзи, карнизы':
            return [3000, 3150, "Все для дома, Шторы, жалюзи, карнизы"]
        case 'с_03_Текстиль и ковры':
            return [3000, 3160, "Все для дома, Текстиль и ковры"]
        case 'с_03_Освещение':
            return [3000, 3170, "Все для дома, Освещение"]
        case 'с_03_Хозяйственные товары':
            return [3000, 3110, "Все для дома, Хозяйственные товары"]
        case 'с_03_Посуда и кухонные аксессуары':
            return [3000, 3100, "Все для дома, Посуда и кухонные аксессуары"]
        case 'с_03_Комнатные растения':
            return [3000, 3120, "Все для дома, Комнатные растения"]
        case 'с_03_Бытовые услуги':
            return [3000, 3130, "Все для дома, Бытовые услуги"]
        case 'с_03_Ремонт':
            return [3000, 3140, "Все для дома, Ремонт, сборка, перетяжка мебели"]  
    }
}




const subCategories_14_Switch = (action)=>{
    switch (action) {
        case 'с_14_По всей категории':
            return [14000, "", "Ремонт и стройка"]
        case 'с_14_Строительный инструмент':
            return [14000, 14010, "Ремонт и стройка, Строительный инструмент"]
        case 'с_14_Строительное оборудование':
            return [14000, 14180, "Ремонт и стройка, Строительное оборудование"]
        case 'с_14_Сантехника и отопление':
            return [14000, 14020, "Ремонт и стройка, Сантехника и отопление"]
        case 'с_14_Стройматериалы':
            return [14000, 14030, "Ремонт и стройка, Стройматериалы"]
        case 'с_14_Отделочные материалы':
            return [14000, 14040, "Ремонт и стройка, Отделочные материалы"]
        case 'с_14_Окна и двери':
            return [14000, 14050, "Ремонт и стройка, Окна и двери"]
        case 'с_14_Дома, срубы и сооружения':
            return [14000, 14080, "Ремонт и стройка, Дома, срубы и сооружения"]
        case 'с_14_Ворота, заборы':
            return [14000, 14090, "Ремонт и стройка, Ворота, заборы"]
        case 'с_14_Электроснабжение':
            return [14000, 14100, "Ремонт и стройка, Электроснабжение"]
        case 'с_14_Средства индивидуальной защиты':
            return [14000, 14190, "Ремонт и стройка, Средства индивидуальной защиты"]
        case 'с_14_Прочее для ремонта и стройки':
            return [14000, 14060, "Ремонт и стройка, Прочее для ремонта и стройки"]
        case 'с_14_Строительные работы':
            return [14000, 14070, "Ремонт и стройка, Строительные работы"]
        case 'с_14_Ремонт квартиры, дома':
            return [14000, 14170, "Ремонт и стройка, Ремонт квартиры, дома"]  
    }
}


const subCategories_10_Switch = (action)=>{
    switch (action) {
        case 'с_10_По всей категории':
            return [10000, "", "Сад и огород"]
        case 'с_10_Садовая мебель и бассейны':
            return [10000, 10010, "Сад и огород, Садовая мебель и бассейны"]
        case 'с_10_Мангалы, аксессуары, топливо':
            return [10000, 10100, "Сад и огород, Мангалы, аксессуары, топливо"]
        case 'с_10_Мотоблоки и культиваторы':
            return [10000, 10110, "Сад и огород, Мотоблоки и культиваторы"]
        case 'с_10_Садовая техника':
            return [10000, 10030, "Сад и огород, Садовая техника"]
        case 'с_10_Садовый инвентарь':
            return [10000, 10050, "Сад и огород, Садовый инвентарь"]
        case 'с_10_Теплицы и парники':
            return [10000, 10040, "Сад и огород, Теплицы и парники"]
        case 'с_10_Растения, рассада и семена':
            return [10000, 10020, "Сад и огород, Растения, рассада и семена"]
        case 'с_10_Удобрения и агрохимия':
            return [10000, 10060, "Сад и огород, Удобрения и агрохимия"]
        case 'с_10_Все для пчеловода':
            return [10000, 10070, "Сад и огород, Все для пчеловода"]
        case 'с_10_Бани, хозблоки, санузлы':
            return [10000, 10090, "Сад и огород, Бани, хозблоки, санузлы"]
        case 'с_10_Прочее для сада и огорода':
            return [10000, 10080, "Сад и огород, Прочее для сада и огорода"]
        case 'с_10_Комнатные растения':
            return [10000, 10120, "Сад и огород, Комнатные растения"]
        case 'с_10_Cельхозтехника':
            return [10000, 10130, "Сад и огород, Cельхозтехника"]
        case 'с_10_Срубы, бытовки, кунги':
            return [10000, 10140, "Сад и огород, Срубы, бытовки, кунги"]
        case 'с_10_Услуги: cад, благоустройство':
            return [10000, 10150, "Сад и огород, Услуги: cад, благоустройство"] 
    }
}


const subCategories_04_Switch = (action)=>{
    switch (action) {
        case 'с_04_По всей категории':
            return [4000, "", "Хобби, спорт и туризм"]
        case 'с_04_CD, DVD, пластинки':
            return [4000, 4010, "Хобби, спорт и туризм, CD, DVD, пластинки"]
        case 'с_04_Антиквариат и коллекции':
            return [4000, 4030, "Хобби, спорт и туризм, Антиквариат и коллекции"]
        case 'с_04_Билеты':
            return [4000, 4120, "Хобби, спорт и туризм, Билеты"]
        case 'с_04_Книги и журналы':
            return [4000, 4040, "Хобби, спорт и туризм, Книги и журналы"]
        case 'с_04_Металлоискатели':
            return [4000, 4130, "Хобби, спорт и туризм, Металлоискатели"]
        case 'с_04_Музыкальные инструменты':
            return [4000, 4070, "Хобби, спорт и туризм, Музыкальные инструменты"]
        case 'с_04_Настольные игры и пазлы':
            return [4000, 4140, "Хобби, спорт и туризм, Настольные игры и пазлы"]
        case 'с_04_Охота и рыбалка':
            return [4000, 4060, "Хобби, спорт и туризм, Охота и рыбалка"]
        case 'с_04_Туристические товары':
            return [4000, 4090, "Хобби, спорт и туризм, Туристические товары"]
        case 'с_04_Радиоуправляемые модели':
            return [4000, 4150, "Хобби, спорт и туризм, Радиоуправляемые модели"]
        case 'с_04_Рукоделие':
            return [4000, 4080, "Хобби, спорт и туризм, Рукоделие"]
        case 'с_04_Спорттовары':
            return [4000, 4020, "Хобби, спорт и туризм, Спорттовары"]
        case 'с_04_Велосипеды':
            return [4000, 4050, "Хобби, спорт и туризм, Велосипеды"]
        case 'с_04_Электротранспорт':
            return [4000, 4160, "Хобби, спорт и туризм, Электротранспорт"]
        case 'с_04_Туристические услуги':
            return [4000, 4110, "Хобби, спорт и туризм, Туристические услуги"]
        case 'с_04_Прочее в Хобби, спорт и туризм':
            return [4000, 4100, "Хобби, спорт и туризм, Прочее в Хобби, спорт и туризм"]  
    }
}

const subCategories_09_Switch = (action)=>{
    switch (action) {
        case 'с_09_По всей категории':
            return [9000, "", "Свадьба и праздники"]
        case 'с_09_Свадебные платья':
            return [9000, 9020, "Свадьба и праздники, Свадебные платья"]
        case 'с_09_Свадебные костюмы':
            return [9000, 9030, "Свадьба и праздники, Свадебные костюмы"]
        case 'с_09_Свадебная обувь':
            return [9000, 9040, "Свадьба и праздники, Свадебная обувь"]
        case 'с_09_Свадебные аксессуары':
            return [9000, 9050, "Свадьба и праздники, Свадебные аксессуары"]
        case 'с_09_Подарки и праздничные товары':
            return [9000, 9010, "Свадьба и праздники, Подарки и праздничные товары"]
        case 'с_09_Карнавальные костюмы':
            return [9000, 9070, "Свадьба и праздники, Карнавальные костюмы"]
        case 'с_09_Услуги для торжеств':
            return [9000, 9060, "Свадьба и праздники, Карнавальные костюмы"]  
    }
}

const subCategories_11_Switch = (action)=>{
    switch (action) {
        case 'с_11_По всей категории':
            return [11000, "", "Животные"]
        case 'с_11_Домашние питомцы':
            return [11000, 11010, "Животные, Домашние питомцы"]
        case 'с_11_Сельхоз животные':
            return [11000, 11020, "Животные, Сельхоз животные"]
        case 'с_11_Товары для животных':
            return [11000, 11030, "Животные, Товары для животных"]
        case 'с_11_Вязка животных':
            return [11000, 11050, "Животные, Вязка животных"]
        case 'с_11_Услуги для животных':
            return [11000, 11040, "Животные, Услуги для животных"]    
    }
}

const subCategories_20_Switch = (action)=>{
    switch (action) {
        case 'с_20_По всей категории':
            return [20000, "", "Готовый бизнес и оборудование"]
        case 'с_20_Готовый бизнес':
            return [20000, 20010, "Готовый бизнес и оборудование, Готовый бизнес"]
        case 'с_20_Оборудование для бизнеса':
            return [20000, 20020, "Готовый бизнес и оборудование, Оборудование для бизнеса"] 
    }
}

const subCategories_06_Switch = (action)=>{
    switch (action) {
        case 'с_06_По всей категории':
            return [6000, "", "Работа"]
        case 'с_06_Вакансии':
            return [6000, 6010, "Работа, Вакансии"]
        case 'с_06_Ищу работу':
            return [6000, 6020, "Работа, Ищу работу"]   
    }
}


const subCategories_13_Switch = (action)=>{
    switch (action) {
        case 'с_13_По всей категории':
            return [13000, "", "Услуги"]
        case 'с_13_Услуги для авто':
            return [13000, 13010, "Услуги, Услуги для авто"]
        case 'с_13_Бытовые услуги':
            return [13000, 13020, "Услуги, Бытовые услуги"]
        case 'с_13_Компьютерные услуги, интернет':
            return [13000, 13030, "Услуги, Компьютерные услуги, интернет"]
        case 'с_13_Ремонт техники и электроники':
            return [13000, 13210, "Услуги, Ремонт техники и электроники"]
        case 'с_13_Красота и здоровье':
            return [13000, 13040, "Услуги, Красота и здоровье"]
        case 'с_13_Няни и сиделки':
            return [13000, 13050, "Услуги, Няни и сиделки"]
        case 'с_13_Образовательные услуги':
            return [13000, 13200, "Услуги, Образовательные услуги"]
        case 'с_13_Услуги переводчика, секретаря':
            return [13000, 13060, "Услуги, Услуги переводчика, секретаря"]
        case 'с_13_Перевозки пассажиров и грузов':
            return [13000, 13070, "Услуги, Перевозки пассажиров и грузов"]
        case 'с_13_Реклама, полиграфия':
            return [13000, 13080, "Услуги, Реклама, полиграфия"]
        case 'с_13_Строительные работы':
            return [13000, 13090, "Услуги, Строительные работы"]
        case 'с_13_Ремонт квартиры, дома':
            return [13000, 13190, "Услуги, Ремонт квартиры, дома"]
        case 'с_13_Ремонт, сборка, перетяжка':
            return [13000, 13180, "Услуги, Ремонт, сборка, перетяжка мебели"]
        case 'с_13_Ремонт и пошив одежды':
            return [13000, 13160, "Услуги, Ремонт и пошив одежды"]
        case 'с_13_Сад, благоустройство':
            return [13000, 13100, "Услуги, Сад, благоустройство"]
        case 'с_13_Услуги для животных':
            return [13000, 13110, "Услуги, Услуги для животных"]
        case 'с_13_Фото и видеосъемка':
            return [13000, 13120, "Услуги, Фото и видеосъемка"]
        case 'с_13_Юридические услуги':
            return [13000, 13130, "Услуги, Юридические услуги"]
        case 'с_13_Туристические услуги':
            return [13000, 13140, "Услуги, Туристические услуги"]
        case 'с_13_Услуги для торжеств':
            return [13000, 13170, "Услуги, Услуги для торжеств"]
        case 'с_13_Аренда бань и беседок':
            return [13000, 13220, "Услуги, Аренда бань и беседок"]
        case 'с_13_Прочие услуги':
            return [13000, 13150, "Услуги, Прочие услуги"]
    }
}


const subCategories_07_Switch = (action)=>{

    switch (action) {
        case 'с_07_По всей категории':
            return [7000, "", "Прочее"]
        case 'с_07_Бюро находок':
            return [7000, 7030, "Прочее, Бюро находок"]
        case 'с_07_Кальяны':
            return [7000, 7070, "Прочее, Кальяны"]
        case 'с_07_Канцелярские товары':
            return [7000, 7060, "Прочее, Канцелярские товары"]
        case 'с_07_Продукты питания':
            return [7000, 7020, "Прочее, Продукты питания"]
        case 'с_07_Электронные парогенераторы':
            return [7000, 7080, "Прочее, Электронные парогенераторы"]
        case 'с_07_Спрос':
            return [7000, 7040, "Прочее, Спрос"]
        case 'с_07_Все остальное':
            return [7000, 7010, "Прочее, Все остальное"]    
    }
}




const statesSwitch = (action, objectLink)=>{

    switch (action) {
        case 's___Брестская':
            objectLink.state = 1; objectLink.town = ""; objectLink.placeTxt = "Брестская область";
            return ["Выберите город в - Брестская область:", subTownBtn_Brestskaya]
        case 's___Гомельская':
            objectLink.state = 2; objectLink.town = ""; objectLink.placeTxt = "Гомельская область";
            return ["Выберите город в - Гомельская область", subTownBtn_Gomelskaya]
        case 's___Гродненская':
            objectLink.state = 3; objectLink.town = ""; objectLink.placeTxt = "Гродненская область";
            return ["Выберите город в - Гродненская область", subTownBtn_Grodnenskaya]
        case 's___Могилевская':
            objectLink.state = 4; objectLink.town = ""; objectLink.placeTxt = "Могилевская область";
            return ["Выберите город в - Могилевская область", subTownBtn_Mogilevskaya]
        case 's___Минская':
            objectLink.state = 5; objectLink.town = ""; objectLink.placeTxt = "Минская область";
            return ["Выберите город в - Минская область", subTownBtn_Minskaya]
        case 's___Витебская':
            objectLink.state = 6; objectLink.town = ""; objectLink.placeTxt = "Витебская область";
            return ["Выберите город в - Витебская область", subTownBtn_Vitebskaya]
        case 's___Минск':
            objectLink.state = 7; objectLink.town = ""; objectLink.placeTxt = "Минск";
            return ["Выберите район в - Минск", subTownBtn_Minsk]
    }
}





const subStatesMinskSwitch = (action)=>{

    switch (action) {
        case 's_07_Минск':
            return [7, "", "Минск"]
        case 's_07_Центральный':
            return [7, 22, "Минск, Центральный"]
        case 's_07_Советский':
            return [7, 23, "Минск, Советский"]
        case 's_07_Первомайский':
            return [7, 24, "Минск, Первомайский"]
        case 's_07_Партизанский':
            return [7, 25, "Минск, Партизанский"]
        case 's_07_Заводской':
            return [7, 26, "Минск, Заводской"]
        case 's_07_Ленинский':
            return [7, 27, "Минск, Ленинский"]
        case 's_07_Октябрьский':
            return [7, 28, "Минск, Октябрьский"]
        case 's_07_Московский':
            return [7, 29, "Минск, Московский"]  
        case 's_07_Фрунзенский':
            return [7, 30, "Минск, Фрунзенский"]  
    }
}

const subStatesBrestskayaSwitch = (action)=>{
    switch (action) {
        case 's_01_Брестская область':
            return [1, "", "Бресткая область"]
        case 's_01_Брест':
            return [1, 1, "Бресткая область, Брест"]
        case 's_01_Барановичи':
            return [1, 37, "Бресткая область, Барановичи"]
        case 's_01_Береза':
            return [1, 38, "Бресткая область, Береза"]
        case 's_01_Белоозёрск':
            return [1, 123, "Бресткая область, Белоозёрск"]
        case 's_01_Высокое':
            return [1, 148, "Бресткая область, Высокое"]
        case 's_01_Ганцевичи':
            return [1, 48, "Бресткая область, Ганцевичи"]
        case 's_01_Давид - Городок':
            return [1, 147, "Бресткая область, Давид - Городок"]
        case 's_01_Дрогичин':
            return [1, 49, "Бресткая область, Дрогичин"]  
        case 's_01_Жабинка':
            return [1, 50, "Бресткая область, Жабинка"]  
        case 's_01_Иваново':
            return [1, 51, "Бресткая область, Иваново"]
        case 's_01_Ивацевичи':
            return [1, 52, "Бресткая область, Ивацевичи"]
        case 's_01_Каменец':
            return [1, 53, "Бресткая область, Каменец"]
        case 's_01_Кобрин':
            return [1, 2, "Бресткая область, Кобрин"]
        case 's_01_Лунинец':
            return [1, 3, "Бресткая область, Лунинец"]  
        case 's_01_Ляховичи':
            return [1, 54, "Бресткая область, Ляховичи"]  
        case 's_01_Малорита':
            return [1, 55, "Бресткая область, Малорита"]
        case 's_01_Микашевичи':
            return [1, 146, "Бресткая область, Микашевичи"]
        case 's_01_Пинск':
            return [1, 4, "Бресткая область, Пинск"]
        case 's_01_Пружаны':
            return [1, 56, "Бресткая область, Пружаны"]  
        case 's_01_Столин':
            return [1, 57, "Бресткая область, Столин"]   
        case 's_01_Другие города':
            return [1, 31, "Бресткая область, Другие города"]         
    }
}

const subStatesGomelskayaSwitch = (action)=>{

    switch (action) {
        case 's_02_Гомельская область':
            return [2, "", "Гомельская область"]
        case 's_02_Гомель':
            return [2, 5, "Гомельская область, Гомель"]
        case 's_02_Брагин':
            return [2, 128, "Гомельская область, Брагин"]
        case 's_02_Буда-Кошелево':
            return [2, 58, "Гомельская область, Буда-Кошелево"]
        case 's_02_Василевичи':
            return [2, 149, "Гомельская область, Василевичи"]
        case 's_02_Ветка':
            return [2, 59, "Гомельская область, Ветка"]
        case 's_02_Добруш':
            return [2, 60, "Гомельская область, Добруш"]
        case 's_02_Ельск':
            return [2, 61, "Гомельская область, Ельск"]
        case 's_02_Житковичи':
            return [2, 62, "Гомельская область, Житковичи"]  
        case 's_02_Жлобин':
            return [2, 6, "Гомельская область, Жлобин"]  
        case 's_02_Калинковичи':
            return [2, 63, "Гомельская область, Калинковичи"]
        case 's_02_Корма':
            return [2, 129, "Гомельская область, Корма"]
        case 's_02_Лельчицы':
            return [2, 130, "Гомельская область, Лельчицы"]
        case 's_02_Лоев':
            return [2, 131, "Гомельская область, Лоев"]
        case 's_02_Мозырь':
            return [2,7, "Гомельская область, Мозырь"]  
        case 's_02_г.п. Октябрьский':
            return [2, 132, "Гомельская область, г.п. Октябрьский"]  
        case 's_02_Наровля':
            return [2, 64, "Гомельская область, Наровля"]
        case 's_02_Петриков':
            return [2, 65, "Гомельская область, Петриков"]
        case 's_02_Речица':
            return [2, 8, "Гомельская область, Речица"]
        case 's_02_Рогачев':
            return [2, 66, "Гомельская область, Рогачев"]  
        case 's_02_Светлогорск':
            return [2, 39, "Гомельская область, Светлогорск"]   
        case 's_02_Хойники':
            return [2, 67, "Гомельская область, Хойники"]
        case 's_02_Чечерск':
            return [2, 68, "Гомельская область, Чечерск"]  
        case 's_02_Другие города':
            return [2, 32, "Гомельская область, Другие города"]         
    }
}


const subStatesGrodnenskayaSwitch = (action)=>{

    switch (action) {
        case 's_03_Гродненская область':
            return [3, "", "Гродненская область"]
        case 's_03_Гродно':
            return [3, 9, "Гродненская область, Гродно"]
        case 's_03_Березовка':
            return [3, 69, "Гродненская область, Березовка"]
        case 's_03_Берестовица':
            return [3, 133, "Гродненская область, Берестовица"]
        case 's_03_Волковыск':
            return [3, 40, "Гродненская область, Волковыск"]
        case 's_03_Вороново':
            return [3, 134, "Гродненская область, Вороново"]
        case 's_03_Дятлово':
            return [3, 70, "Гродненская область, Дятлово"]  
        case 's_03_Зельва':
            return [3, 135, "Гродненская область, Зельва"]  
        case 's_03_Ивье':
            return [3, 71, "Гродненская область, Ивье"]
        case 's_03_Кореличи':
            return [3, 136, "Гродненская область, Кореличи"]
        case 's_03_Лида':
            return [3, 10, "Гродненская область, Лида"]
        case 's_03_Мосты':
            return [3, 72, "Гродненская область, Мосты"]
        case 's_03_Новогрудок':
            return [3, 73, "Гродненская область, Новогрудок"]  
        case 's_03_Островец':
            return [3, 74, "Гродненская область, Островец"]  
        case 's_03_Ошмяны':
            return [3, 75, "Гродненская область, Ошмяны"]
        case 's_03_Свислочь':
            return [3, 76, "Гродненская область, Свислочь"]
        case 's_03_Скидель':
            return [3, 77, "Гродненская область, Скидель"]
        case 's_03_Слоним':
            return [3, 11, "Гродненская область, Слоним"]  
        case 's_03_Сморгонь':
            return [3, 41, "Гродненская область, Сморгонь"]   
        case 's_03_Щучин':
            return [3, 78, "Гродненская область, Щучин"]
        case 's_03_Другие города':
            return [3, 33, "Гродненская область, Другие города"]         
    }
}

const subStatesMogilevskayaSwitch = (action)=>{

    switch (action) {
        case 's_04_Могилевская область':
            return [4, "", "Могилевская область"]
        case 's_04_Могилев':
            return [4, 13, "Могилевская область, Могилев"]
        case 's_04_Белыничи':
            return [4, 137, "Могилевская область, Белыничи"]
        case 's_04_Бобруйск':
            return [4, 12, "Могилевская область, Бобруйск"]
        case 's_04_Быхов':
            return [4, 79, "Могилевская область, Быхов"]
        case 's_04_Глуск':
            return [4, 80, "Могилевская область, Глуск"]
        case 's_04_Горки':
            return [4, 42, "Могилевская область, Горки"]
        case 's_04_Дрибин':
            return [4, 138, "Могилевская область, Дрибин"]
        case 's_04_Кировск':
            return [4, 81, "Могилевская область, Кировск"]  
        case 's_04_Климовичи':
            return [4, 82, "Могилевская область, Климовичи"]  
        case 's_04_Кличев':
            return [4, 83, "Могилевская область, Кличев"]
        case 's_04_Краснополье':
            return [4, 139, "Могилевская область, Краснополье"]
        case 's_04_Круглое':
            return [4, 140, "Могилевская область, Круглое"]
        case 's_04_Костюковичи':
            return [4, 84, "Могилевская область, Костюковичи"]
        case 's_04_Кричев':
            return [4, 43, "Могилевская область, Кричев"]  
        case 's_04_Мстиславль':
            return [4, 85, "Могилевская область, Мстиславль"]  
        case 's_04_Осиповичи':
            return [4, 14, "Могилевская область, Осиповичи"]
        case 's_04_Славгород':
            return [4, 86, "Могилевская область, Славгород"]
        case 's_04_Чаусы':
            return [4, 87, "Могилевская область, Чаусы"]
        case 's_04_Чериков':
            return [4, 88, "Могилевская область, Чериков"]  
        case 's_04_Шклов':
            return [4, 89, "Могилевская область, Шклов"]   
        case 's_04_Хотимск':
            return [4, 141, "Могилевская область, Хотимск"]
        case 's_04_Другие города':
            return [4, 34, "Могилевская область, Другие города"] 
         
    }
}

const subStatesMinskayaSwitch = (action)=>{

    switch (action) {
        case 's_05_Минская область':
            return [5, "", "Минская область"]  

        case 's_05_Минский район':
            return [5, 142, "Минская область, Минский район"]
        case 's_05_Березино':
            return [5, 91, "Минская область, Березино"]
        case 's_05_Борисов':
            return [5, 15, "Минская область, Борисов"]
        case 's_05_Вилейка':
            return [5, 92, "Минская область, Вилейка"]
        case 's_05_Воложин':
            return [5, 93, "Минская область, Воложин"]
        case 's_05_Дзержинск':
            return [5, 94, "Минская область, Дзержинск"]
        case 's_05_Жодино':
            return [5, 44, "Минская область, Жодино"] 
        case 's_05_Заславль':
            return [5, 143, "Минская область, Заславль"]  
        case 's_05_Клецк':
            return [5, 95, "Минская область, Клецк"]
        case 's_05_Копыль':
            return [5, 96, "Минская область, Копыль"]
        case 's_05_Крупки':
            return [5, 97, "Минская область, Крупки"]
        case 's_05_Логойск':
            return [5, 98, "Минская область, Логойск"]
        case 's_05_Любань':
            return [5, 99, "Минская область, Любань"]  
        case 's_05_Марьина Горка':
            return [5, 122, "Минская область, Марьина Горка"]  
        case 's_05_Молодечно':
            return [5, 16, "Минская область, Молодечно"]
        case 's_05_Мядель':
            return [5, 100, "Минская область, Мядель"]
        case 's_05_Несвиж':
            return [5, 101, "Минская область, Несвиж"]
        case 's_05_Руденск':
            return [5, 145, "Минская область, Руденск"]  
        case 's_05_Слуцк':
            return [5, 17, "Минская область, Слуцк"]   
        case 's_05_Смолевичи':
            return [5, 102, "Минская область, Смолевичи"]
        case 's_05_Солигорск':
            return [5, 45, "Минская область, Солигорск"]
        case 's_05_Старые Дороги':
            return [5, 103, "Минская область, Старые Дороги"]
        case 's_05_Столбцы':
            return [5, 104, "Минская область, Столбцы"]
        case 's_05_Узда':
            return [5, 105, "Минская область, Узда"]  
        case 's_05_Фаниполь':
            return [5, 144, "Минская область, Фаниполь"]   
        case 's_05_Червень':
            return [5, 106, "Минская область, Червень"]
        case 's_05_Другие города':
            return [5, 35, "Минская область, Другие города"]             
    }
}

const subStatesVitebskayaSwitch = (action)=>{

    switch (action) {
        case 's_06_Витебская область':
            return [6, "", "Витебская область"]
        case 's_06_Витебск':
            return [6, 18, "Витебская область, Витебск"]
        case 's_06_Бешенковичи':
            return [6, 125, "Витебская область, Бешенковичи"]
        case 's_06_Барань':
            return [6, 107, "Витебская область, Барань"]
        case 's_06_Браслав':
            return [6, 108, "Витебская область, Браслав"]
        case 's_06_Верхнедвинск':
            return [6, 109, "Витебская область, Верхнедвинск"]
        case 's_06_Глубокое':
            return [6, 110, "Витебская область, Глубокое"]
        case 's_06_Городок':
            return [6, 111, "Витебская область, Городок"]
        case 's_06_Докшицы':
            return [6, 112, "Витебская область, Докшицы"]  
        case 's_06_Дубровно':
            return [6, 113, "Витебская область, Дубровно"]  
        case 's_06_Лепель':
            return [6, 114, "Витебская область, Лепель"]
        case 's_06_Лиозно':
            return [6, 115, "Витебская область, Лиозно"]
        case 's_06_Миоры':
            return [6, 116, "Витебская область, Миоры"]
        case 's_06_Новолукомль':
            return [6, 117, "Витебская область, Новолукомль"]
        case 's_06_Новополоцк':
            return [6, 46, "Витебская область, Новополоцк"]  
        case 's_06_Орша':
            return [6, 19, "Витебская область, Орша"]  
        case 's_06_Полоцк':
            return [6, 20, "Витебская область, Полоцк"]
        case 's_06_Поставы':
            return [6, 47, "Витебская область, Поставы"]
        case 's_06_Россоны':
            return [6, 118, "Витебская область, Россоны"]
        case 's_06_Сенно':
            return [6, 119, "Витебская область, Сенно"]  
        case 's_06_Толочин':
            return [6, 120, "Витебская область, Толочин"]   
        case 's_06_Ушачи':
            return [6, 126, "Витебская область, Ушачи"]
        case 's_06_Чашники':
            return [6, 121, "Витебская область, Чашники"]
        case 's_06_Шарковщина':
            return [6, 127, "Витебская область, Шарковщина"]
        case 's_06_Шумилино':
            return [6, 124, "Витебская область, Шумилино"]
        case 's_06_Другие города':
            return [6, 36, "Витебская область, Другие города"]            
    }
}


module.exports = {
    categoriesSwitch,
    subCategories_01_Switch,
    subCategories_02_Switch,
    subCategories_03_Switch,
    subCategories_04_Switch,
    subCategories_05_Switch,
    subCategories_06_Switch,
    subCategories_07_Switch,
    subCategories_08_Switch,
    subCategories_09_Switch,
    subCategories_10_Switch,
    subCategories_11_Switch,
    subCategories_12_Switch,
    subCategories_13_Switch,
    subCategories_14_Switch,
    subCategories_15_Switch,
    subCategories_16_Switch,
    subCategories_17_Switch,
    subCategories_18_Switch,
    subCategories_19_Switch,
    subCategories_20_Switch,
    subCategories_21_Switch,

    statesSwitch,
    subStatesMinskSwitch,
    subStatesBrestskayaSwitch,
    subStatesGomelskayaSwitch,
    subStatesGrodnenskayaSwitch,
    subStatesMogilevskayaSwitch,
    subStatesMinskayaSwitch,
    subStatesVitebskayaSwitch
};























